diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивСотрудников = ПолучитьСотрудниковПревышениеОтпуска(Объект); 
	УстановитьПодсветкуСтрок(МассивСотрудников);  

КонецПроцедуры 

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Отказ,Элемент) 
	
	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ТекДанные.ДатаНачала > ТекДанные.ДатаОкончания Тогда  
		Сообщить("Дата начала не может быть больше даты окончания");
		ТекДанные.ДатаОкончания = "";
	КонецЕсли;
	
	МассивСотрудников = ПолучитьСотрудниковПревышениеОтпуска(Объект); 
	УстановитьПодсветкуСтрок(МассивСотрудников);	
		
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент) 
	
	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ТекДанные.ДатаНачала > ТекДанные.ДатаОкончания Тогда  
		Сообщить("Дата начала не может быть больше даты окончания");
		ТекДанные.ДатаНачала = "";
	КонецЕсли;

	
	МассивСотрудников = ПолучитьСотрудниковПревышениеОтпуска(Объект); 
	УстановитьПодсветкуСтрок(МассивСотрудников);	
		
КонецПроцедуры 

&НаСервере
Функция ПолучитьСотрудниковПревышениеОтпуска(Знач Объект) 
	
	МассивСотрудников = Новый Массив;
	СотрудникиТЧ = Объект.ОтпускаСотрудников.Выгрузить(); 
	СотрудникиТЧ.Колонки.Добавить("СуммаДней",Новый ОписаниеТипов("Число"));
	Для Каждого СтрТЗ Из СотрудникиТЧ Цикл
		ДлинаИнтервала = СтрТЗ.ДатаОкончания - СтрТз.ДатаНачала; 
		СтрТЗ.СуммаДней = ДлинаИнтервала / 86400 + 1;
			
	КонецЦикла;
	
	СотрудникиТЧ.Свернуть("Сотрудник","СуммаДней"); 
			
	Для Каждого СтрокаТЗ Из СотрудникиТЧ Цикл
		Если СтрокаТЗ.СуммаДней > 28 Тогда
			МассивСотрудников.Добавить(СтрокаТЗ.Сотрудник);
		КонецЕсли;
	КонецЦикла;
		
	Возврат МассивСотрудников;
	
КонецФункции

&НаСервере
Процедура УстановитьПодсветкуСтрок(МассивСотрудников)
	
		УсловноеОформление.Элементы.Очистить();
		
	Для Каждого ЭлементМассива Из МассивСотрудников Цикл
		
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	    ЭлементОформления.Использование = Истина;
	    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",  Новый Цвет(255,0,0));
		                               
		ЭлементУсловия                = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
		ЭлементУсловия.ПравоеЗначение = ЭлементМассива;
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;   
		ЭлементУсловия.Использование  = Истина;
		
		ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
	    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");
		
	КонецЦикла;
       
КонецПроцедуры  

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",,ЭтаФорма);
	
	
КонецПроцедуры 

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()Экспорт 
	
	ОтпускаСотрудниковДанные = Новый Массив;
	Для Каждого СтрТЧ из Объект.ОтпускаСотрудников Цикл
		СотрудникСтруктура = Новый Структура ("Фамилия,Начало,Конец",
												СтрТЧ.Сотрудник,
													СтрТЧ.ДатаНачала,
														СтрТЧ.ДатаОкончания);
		ОтпускаСотрудниковДанные.Добавить(СотрудникСтруктура);
	КонецЦикла;
	
	Адрес = ПоместитьВоВременноеХранилище(ОтпускаСотрудниковДанные,Новый УникальныйИдентификатор);
	Возврат Адрес;
	
КонецФункции
